// @ts-nocheck
var tlist = {
  1: [
    "元旦",
    "2025-01-01",
    "辞旧迎新庆新春，四季轮回展宏图。愿君岁岁平安康，福星高照人如意。",
  ],
  2: [
    "春节",
    "2025-01-29",
    "春风送暖入屠苏，万象更新福满门。阖家欢乐迎新岁，欢天喜地庆团圆。",
  ],
  3: [
    "元宵",
    "2025-02-12",
    "花灯高照夜如水，月圆人圆情意浓。团团圆圆心相系，喜庆佳节共此时。",
  ],
  4: [
    "清明",
    "2025-04-04",
    "清明时节雨纷纷，思念故人泪满巾。扫墓祭祖凭哀思，感恩不忘报亲恩。",
  ],
  5: [
    "劳动",
    "2025-05-01",
    "春风得意花开好，勤劳奋斗梦远行。双手创造幸福路，汗水凝聚富贵情。",
  ],
  6: [
    "端午",
    "2025-05-31",
    "粽香四溢龙舟行，五月五日节传情。祭屈原人心志，平安康健乐满盈。",
  ],
  7: [
    "国庆",
    "2025-10-01",
    "祖国河山美如画，亿万人民庆华诞。山河壮丽同共祝，国泰民安岁月长。",
  ],
  8: [
    "中秋",
    "2025-10-06",
    "银盘高悬夜如银，千里共婵娟。望月思亲心常在，团圆欢乐又一年。",
  ],
  9: [
    "元旦",
    "2026-01-01",
    "新年到来万象新，愿君福寿常在心。事业腾飞皆如意，家和万事喜盈门。",
  ],
  10: [
    "春节",
    "2026-02-17",
    "春风送暖福临门，家家户户庆团圆。欢声笑语声声响，迎来新岁乐开颜。",
  ],
  11: [
    "元宵",
    "2026-02-25",
    "花灯辉映夜空明，元宵节庆乐盈门。愿你事事如愿意，家圆人圆梦圆心。",
  ],
  12: [
    "清明",
    "2026-04-04",
    "清明时节思故人，缅怀先祖泪满巾。祭扫先人铭恩德，怀念永驻心中深。",
  ],
  13: [
    "劳动",
    "2026-05-01",
    "春光明媚劳动节，辛勤耕耘得实惠。愿君幸福常相伴，事业兴旺展宏图。",
  ],
  14: [
    "端午",
    "2026-06-14",
    "龙舟竞渡水花飞，粽香四溢飘千里。端午佳节共团圆，平安喜乐到人间。",
  ],
  15: [
    "国庆",
    "2026-10-01",
    "祖国大地山河壮，欢庆盛世庆华诞。愿国强民富安康，万民同庆乐无疆。",
  ],
  16: [
    "中秋",
    "2026-10-05",
    "明月高悬照大地，心随月圆思亲情。愿你此时共团圆，幸福安康如意行。",
  ],
  17: [
    "元旦",
    "2027-01-01",
    "新春新岁喜盈门，愿君福运常如意。事业顺利步步高，家和万事安康地。",
  ],
  18: [
    "春节",
    "2027-02-09",
    "红灯高挂喜气浓，辞旧迎新万象新。愿君春风得意行，岁岁年年皆安宁。",
  ],
  19: [
    "元宵",
    "2027-02-17",
    "花灯璀璨照夜空，元宵团圆庆丰收。愿你事事如意顺，家人团聚乐悠悠。",
  ],
  20: [
    "清明",
    "2027-04-04",
    "清明时节思亲人，远在他乡泪满巾。祭祖扫墓怀敬意，感恩先人永铭心。",
  ],
};
const lFestival = {
  "12-30": { title: "除夕" },
  "1-1": { title: "春节" },
  "1-15": { title: "元宵节" },
  "2-2": { title: "龙抬头" },
  "5-5": { title: "端午节" },
  "7-7": { title: "七夕节" },
  "7-15": { title: "中元节" },
  "8-15": { title: "中秋节" },
  "9-9": { title: "重阳节" },
  "10-1": { title: "寒衣节" },
  "10-15": { title: "下元节" },
  "12-8": { title: "腊八节" },
  "12-23": { title: "北方小年" },
  "12-24": { title: "南方小年" },
};
const festival = {
  "1-1": { title: "元旦节" },
  "2-14": { title: "情人节" },
  "5-1": { title: "劳动节" },
  "5-4": { title: "青年节" },
  "6-1": { title: "儿童节" },
  "9-10": { title: "教师节" },
  "10-1": { title: "国庆节" },
  "12-25": { title: "圣诞节" },

  "3-8": { title: "妇女节" },
  "3-12": { title: "植树节" },
  "4-1": { title: "愚人节" },
  "5-12": { title: "护士节" },
  "7-1": { title: "建党节" },
  "8-1": { title: "建军节" },
  "12-24": { title: "平安夜" },
};
let dic = {
  1: "距离放假，还要摸鱼多少天？",
  2: "坚持住，就快放假啦！",
  3: "上班好累呀，下顿吃啥？",
  4: "努力，我还能加班24小时！",
  5: "今日宜：吃饭饭  忌：减肥",
  6: "躺平中，等放假",
  7: "只有摸鱼才是赚老板的钱",
  10: "小乌龟慢慢爬",
  11: "加油，明天会更好！",
  12: "生活本该如此轻松",
  13: "好累，但还能坚持一会儿",
  14: "最近好像又胖了，唉",
  15: "快放假啦，期待放松的时光",
  16: "今天的目标是先活下去",
  17: "给自己加个鸡腿！",
  18: "只要努力工作，老板的午餐就是我的",
  19: "今天的任务是：不干活！",
  20: "用力生活，用力摸鱼",
};
//>图标依次切换乌龟、兔子、闹钟、礼品盒
/**
 * @param {number} num
 */
function icon_now(num) {
  if (num <= 7 && num > 3) {
    return "hare";
  } else if (num <= 3 && num > 0) {
    return "timer";
  } else if (num == 0) {
    return "gift";
  } else {
    return "tortoise";
  }
}

$httpClient.get(
  {
    url: "https://60s.viki.moe/v2/moyu?encoding=json",
    headers: {
      referer: "https://60s.viki.moe/",
      "user-agent":
        "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/108.0.0.0 Safari/537.36",
    },
    timeout: 5,
  },

  (error, response, data) => {
    data = JSON.parse(data);

    $done({
      title: `${data.data.nextHoliday.name}: ${data.data.nextHoliday.duration}天`,
      content: data.data.moyuQuote,
      icon: icon_now(data.data.nextHoliday.duration),
    });
  }
);
